{
	"id_pratica": 1,
	"nome": "JavaScript",
	"contexto": "2",
	"questao1": "###### INTRODUÇÃO AO JAVASCRIPT  \n# Console  \n<kbd> 4 minutos </kbd> \n  \nO console é um painel que exibe mensagens importantes, como erros, para desenvolvedores. Grande parte do trabalho que o computador realiza com nosso código é invisível para nós por padrão. Se quisermos ver coisas aparecendo em nossa tela, podemos imprimir ou registrar diretamente em nosso console.\n\nEm JavaScript, a palavra-chave console refere-se a um objeto, uma coleção de dados e ações, que podemos usar em nosso código. Palavras-chave são palavras incorporadas à linguagem JavaScript, para que o computador as reconheça e as trate de maneira especial.\n\nUma ação, ou método, incorporada ao objeto do console é o método <kbd> .log </kbd>. Quando escrevemos <kbd> console.log() </kbd> o que colocamos entre parênteses será impresso, ou registrado, no console.\n\nSerá muito útil imprimir valores no console, para que possamos ver o trabalho que estamos fazendo.\n``` javascript\nconsole.log(5);\n```\nEste exemplo registra 5 no console. O ponto e vírgula indica o fim da linha ou instrução. Embora em JavaScript seu código geralmente seja executado conforme planejado, sem ponto e vírgula, recomendamos aprender o hábito de terminar cada instrução com ponto e vírgula para nunca deixar uma de fora nos poucos casos em que forem necessárias.\n\nVocê verá mais tarde que podemos usar <kbd>console.log()</kbd> para imprimir diferentes tipos de dados.",
	"fk_curso": 1,
	"questao2": "###### VARIÁVEIS \n# Criando uma Variável: var \n<kbd> 4 minutos </kbd> \n  \nHouve muitas mudanças introduzidas na versão ES6 do JavaScript em 2015. Uma das maiores mudanças foram duas novas palavras-chave, let e const, para criar ou declarar variáveis. Antes do ES6, os programadores só podiam usar a palavra-chave var para declarar variáveis.`\n```  javascript\nvar meuNome = 'João';\nconsole.log(meuNome);\n// saída: João\n``` \n`Vamos considerar o exemplo acima:\n\n1. var, abreviação de variável, é uma palavra-chave JavaScript que cria ou declara uma nova variável.\n2. myName é o nome da variável. Colocar letras maiúsculas dessa forma é uma convenção padrão em JavaScript chamada camel case. Na caixa de camelo, você agrupa as palavras em uma, a primeira palavra é minúscula e cada palavra a seguir terá sua primeira letra maiúscula. (por exemplo, camelCaseEverything).\n3. = é o operador de atribuição. Atribui o valor ('Arya') à variável (meuNome).\n4. 'Arya' é o valor atribuído (=) à variável meuNome. Você também pode dizer que a variável myName é inicializada com um valor ‘Arya’.\n5. Após a variável ser declarada, o valor da string 'Arya' é impresso no console referenciando o nome da variável: console.log(myName).\nExistem algumas regras gerais para nomear variáveis:\n\n* Os nomes das variáveis ​​não podem começar com números.\n* Os nomes das variáveis ​​diferenciam maiúsculas de minúsculas, portanto meuNome e meunome seriam variáveis ​​diferentes. É uma má prática criar duas variáveis ​​com o mesmo nome usando casos diferentes.\n* Os nomes das variáveis ​​não podem ser iguais às palavras-chave. Para obter uma lista abrangente de palavras-chave, verifique a documentação de palavras-chave do MDN.\n* Nos próximos exercícios, aprenderemos por que let e const do ES6 são as palavras-chave de variáveis ​​preferidas por muitos programadores. Como ainda há muito código escrito antes do ES6, é útil estar familiarizado com a palavra-chave var pré-ES6.",
	"resposta2": "João",
	"resposta1": "5"
}

